In [56]:
import json
import pandas as pd
import pymongo
from sqlalchemy import create_engine
import seaborn as sns
import matplotlib.pyplot as plt

In [57]:
with open('Global_Temperatures.json', 'r') as file:
    global_temperature = json.load(file)
    
client = pymongo.MongoClient('192.168.56.30', 27017)
db = client.climate
collection = db.global_temperature_collection

for document in global_temperature:
    collection.insert_one(document)

In [58]:
#Extract data from Mongodb
cursor = collection.find()
data = list(cursor)
# Convert data to a pandas DataFrame for temperature
temperature_df = pd.DataFrame(data)
temperature_df

,_id,region,country,state,city,year,average_temperature
0,655d1f8276c65e6d96c48f90,Africa,Algeria,,Algiers,1997,64.926301
1,655d1f8276c65e6d96c48f91,Africa,Algeria,,Algiers,1998,63.619668
2,655d1f8276c65e6d96c48f92,Africa,Algeria,,Algiers,1999,64.923626
3,655d1f8276c65e6d96c48f93,Africa,Algeria,,Algiers,2000,64.182787
4,655d1f8276c65e6d96c48f94,Africa,Algeria,,Algiers,2001,64.669863
...,...,...,...,...,...,...,...
24507,65746dfaf9d7d65e9eae8732,North America,US,Alabama,Birmingham,2016,58.316256
24508,65746dfaf9d7d65e9eae8733,North America,US,Alabama,Birmingham,2017,57.943395
24509,65746dfaf9d7d65e9eae8734,North America,US,Alabama,Birmingham,2018,57.039166
24510,65746dfaf9d7d65e9eae8735,North America,US,Alabama,Birmingham,2019,56.780607
24511,65746dfaf9d7d65e9eae8736,North America,US,Alabama,Birmingham,2020,47.399678

In [59]:
temperature_df.drop(['_id', 'state','region', 'city'], axis=1, inplace=True)
temperature_df['average_temperature'] = temperature_df['average_temperature'].round(2)
temperature_df['country'] = temperature_df['country'].replace({'US': 'USA'})
temperature_df

       country  year  average_temperature
0      Algeria  1997                64.93
1      Algeria  1998                63.62
2      Algeria  1999                64.92
3      Algeria  2000                64.18
4      Algeria  2001                64.67
...        ...   ...                  ...
24507      USA  2016                58.32
24508      USA  2017                57.94
24509      USA  2018                57.04
24510      USA  2019                56.78
24511      USA  2020                47.40

[24512 rows x 3 columns]

In [60]:
temperature_df.dtypes

country                 object
year                     int64
average_temperature    float64
dtype: object

In [61]:
temperature_df = temperature_df.pivot_table(index='country', columns='year', values='average_temperature', aggfunc='mean')
# Resetting index to make 'Country or Area' a regular column 
temperature_df = temperature_df.reset_index()
# Remove column name for index (was affecting layout)
temperature_df.columns.name = None
temperature_df

,country,1995,1996,1997,1998,1999,2000,2001,2002,2003,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Albania,NaN,NaN,71.93,61.61,63.12,63.18,61.24,63.30,63.65,...,59.92,60.32,60.41,60.65,60.96,60.73,60.38,62.10,61.67,51.16
1,Algeria,64.41,63.53,64.93,63.62,64.92,64.18,64.67,64.14,65.49,...,64.96,64.29,63.70,65.65,64.94,65.31,65.00,64.42,64.99,58.03
2,Argentina,61.70,62.71,63.14,61.76,61.84,62.40,63.34,63.01,61.92,...,63.24,63.73,62.88,63.61,63.83,62.19,64.14,63.47,63.07,69.98
3,Australia,61.50,61.26,62.15,62.20,62.47,62.25,62.23,62.69,62.38,...,62.54,62.26,63.38,63.48,63.06,63.41,63.46,63.26,63.88,68.72
4,Austria,50.25,47.68,49.68,51.34,50.96,52.76,50.82,51.87,51.50,...,51.28,51.91,51.43,53.35,53.47,52.11,52.35,53.79,53.91,44.92
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
120,Uzbekistan,59.08,57.18,60.76,59.68,60.31,60.79,61.32,60.86,60.17,...,60.46,58.94,61.28,58.87,61.32,62.15,60.73,60.83,62.00,51.39
121,Venezuela,78.48,80.39,80.17,80.69,79.07,80.19,82.29,81.89,82.12,...,80.44,81.45,80.92,80.64,81.46,81.71,82.84,79.97,79.82,80.26
122,Vietnam,74.39,74.32,75.92,77.10,75.91,74.38,74.34,75.08,75.98,...,73.59,75.26,75.30,75.55,77.16,76.68,76.18,76.33,77.23,70.75
123,Yugoslavia,53.05,51.79,52.22,53.93,53.84,56.60,53.88,55.25,53.61,...,54.25,55.72,55.41,56.08,56.10,55.02,55.55,56.85,56.98,46.37
124,Zambia,72.92,72.20,72.89,74.56,71.80,72.78,72.72,71.04,69.18,...,69.39,69.75,69.93,72.54,NaN,NaN,NaN,NaN,NaN,NaN

In [62]:
# Check for null values in DataFrame
print(temperature_df[temperature_df.isnull().any(axis=1)])

               country   1995   1996   1997   1998   1999   2000   2001  \
0              Albania    NaN    NaN  71.93  61.61  63.12  63.18  61.24
7           Bangladesh  79.35  78.77  77.15  79.29  77.09  79.10  78.96
8             Barbados  81.26  80.95  80.78  81.54  80.54  80.23  80.70
13             Bermuda  71.29  71.20  71.25  72.71  72.62  71.60  71.11
16            Bulgaria  49.43    NaN  48.78  50.74  51.01  51.73  50.72
17             Burundi  79.33  79.21  78.43  82.40  77.40    NaN    NaN
24             Croatia    NaN  52.18  51.82  52.35  53.66  55.85  54.16
26              Cyprus  64.99  69.70  63.42  71.32  65.80  72.81  67.97
36              Gambia  77.94  77.98  79.76  79.81  78.52  78.89  79.83
37             Georgia  57.06  55.59  55.51  58.17  57.20  57.18  57.10
39              Greece  64.95  64.54  63.94  65.50  66.72  65.80  66.14
42       Guinea-Bissau  83.66  83.16  83.41  84.30    NaN    NaN    NaN
43              Guyana    NaN  83.56  80.70  81.90  83.44  82.64  83.50
44               Haiti  86.30  86.10  87.43    NaN  84.38  84.01  85.43
52              Israel  68.62  72.35  68.48  71.10  70.82  69.84  69.89
58               Kenya  68.81  68.04  66.87  66.00  67.93  65.96  65.20
60          Kyrgyzstan    NaN    NaN  28.99  53.53  52.75  54.26  53.38
66              Malawi  68.90  69.92  68.18  71.40  70.33  66.46  68.01
68          Mauritania  77.88  78.14  79.43  78.96  76.92  77.58  78.70
73     Myanmar (Burma)    NaN  81.32  81.76  83.08  81.24  80.85  81.21
81                Oman  90.75    NaN    NaN    NaN    NaN    NaN  83.34
84                Peru  66.74  65.08  71.93  69.50  66.75  65.70  65.17
93   Serbia-Montenegro  49.68  49.34  49.03  50.17  43.58  51.96  52.32
94        Sierra Leone  82.94  81.35  82.41    NaN    NaN    NaN    NaN
108           Thailand    NaN  84.32  85.99  83.84  81.71  82.30  82.65
124             Zambia  72.92  72.20  72.89  74.56  71.80  72.78  72.72

      2002   2003  ...   2011   2012   2013   2014   2015   2016   2017  \
0    63.30  63.65  ...  59.92  60.32  60.41  60.65  60.96  60.73  60.38
7    78.62  78.82  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
8    81.23  81.30  ...  81.39  80.64  80.77  80.66  81.43  81.57  80.69
13   72.14  72.50  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
16   50.43  50.17  ...  51.46  53.20  53.48  53.14  53.37  53.37  52.65
17     NaN  81.30  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
24   54.75  54.46  ...  54.73  55.56  54.37  56.22  55.70  54.83  55.57
26   67.40  58.12  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
36   79.05  79.67  ...  78.74  79.00  78.91  78.80  78.38  78.85  79.31
37   56.29  55.84  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
39   65.20  64.92  ...  66.22  60.16    NaN    NaN    NaN    NaN    NaN
42     NaN    NaN  ...  81.82  81.52  81.96  81.80  81.57  81.91  81.90
43   83.33  83.01  ...  83.06    NaN    NaN    NaN    NaN    NaN    NaN
44   85.93  87.51  ...  84.71  84.58  85.37  85.11  86.47  85.15  84.98
52   70.57  69.74  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
58   65.81  66.68  ...  66.74  67.58  67.14  67.23  67.87  67.96  68.65
60   53.83  53.26  ...  52.42  52.37  54.90  51.89  54.77  54.83  53.83
66   72.18  70.97  ...  71.28  71.69  69.79    NaN    NaN    NaN    NaN
68   77.76  77.51  ...  77.21  77.90  78.58  77.62  78.81  78.41  78.29
73   81.95  81.72  ...  81.57  82.24  81.61  81.15  81.81  82.44  82.45
81   83.59  82.76  ...  83.25  79.78  82.13  82.54  84.49  82.96  81.27
84   66.22  65.73  ...  66.98  68.47  66.16  67.54  69.62    NaN    NaN
93   53.09  53.05  ...    NaN    NaN    NaN    NaN    NaN    NaN    NaN
94   81.88  81.21  ...  81.28    NaN    NaN    NaN    NaN    NaN    NaN
108  84.73  84.49  ...  82.78    NaN    NaN    NaN    NaN    NaN    NaN
124  71.04  69.18  ...  69.39  69.75  69.93  72.54    NaN    NaN    NaN

      2018   2019   2020
0    62.10  61.67  51.16
7      NaN    NaN    NaN
8    79.16    NaN    NaN
13     NaN    NaN    NaN
16   53.04  53.24  42.11
17     NaN    NaN    NaN
24   56.49  56.56  47.55
26     NaN    NaN    NaN
36   77.84  78.77  79.42
37     NaN    NaN    NaN
39     NaN    NaN    NaN
42   81.04  81.99  84.22
43     NaN    NaN    NaN
44   85.17  83.38  81.77
52     NaN    NaN    NaN
58   66.86  68.34  68.97
60   52.83  55.29  44.90
66     NaN    NaN    NaN
68   70.25    NaN    NaN
73   81.95  82.15  82.55
81   83.57  79.83    NaN
84     NaN    NaN    NaN
93     NaN    NaN    NaN
94     NaN    NaN    NaN
108    NaN    NaN    NaN
124    NaN    NaN    NaN

[26 rows x 27 columns]

In [63]:
# Forward fill NaN values
temperature_df = temperature_df.ffill()

# Backward fill NaN values
temperature_df = temperature_df.bfill()

# Drop rows with NaN values after forward and backward fill
temperature_df = temperature_df.dropna()

# Reset index after dropping rows
temperature_df = temperature_df.reset_index(drop=True)

In [64]:
# Selecting year columns 
temperature_years = temperature_df.drop(columns=['country'])
temperature_years.describe().round(2)

,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
count,125.00,125.00,125.00,125.00,125.00,125.00,125.00,125.00,125.00,125.00,...,125.00,125.00,125.00,125.00,125.00,125.00,125.00,125.00,125.00,125.00
mean,66.04,65.27,65.48,66.13,65.56,65.44,65.69,66.26,66.30,66.07,...,66.34,66.05,66.20,66.62,66.91,66.88,66.71,66.72,67.12,62.51
std,13.36,14.07,13.93,13.73,13.22,12.95,13.30,13.30,13.48,13.55,...,13.41,13.61,13.57,13.26,13.43,13.66,13.64,13.28,13.43,16.92
min,31.94,30.54,28.99,32.97,31.31,30.03,29.41,29.70,29.59,31.49,...,27.86,26.25,29.00,30.48,31.87,29.36,31.12,31.04,31.05,17.42
25%,54.39,54.14,52.60,53.76,53.66,53.83,53.38,53.83,54.46,54.22,...,53.75,54.40,54.22,54.59,55.19,54.83,54.14,54.53,55.58,46.37
50%,67.57,66.59,67.09,66.60,66.72,65.70,66.00,66.31,67.15,66.75,...,66.98,67.90,67.14,67.23,67.42,67.49,66.83,66.86,67.41,68.16
75%,78.36,78.77,78.83,79.52,78.52,78.89,79.28,79.65,79.86,79.43,...,79.64,79.32,79.62,79.61,80.34,80.23,80.27,79.54,80.15,79.23
max,90.75,86.10,87.43,85.34,84.38,84.46,85.43,85.93,87.51,86.29,...,84.71,84.58,85.37,85.11,86.47,85.15,85.44,85.36,84.75,85.74

In [65]:
#Checking for outliers 

Q1 = temperature_df.quantile(0.25)
Q3 = temperature_df.quantile(0.75)
IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

# Identify outliers
outliers = (temperature_df < lower_bound) | (temperature_df > upper_bound)

# Display outliers
outliers_countries = temperature_df[['country']][outliers.any(axis=1)]
outliers_countries

Empty DataFrame
Columns: [country]
Index: []

In [66]:
# Mean temperature levels for each country
mean_temperature = temperature_years.mean(axis=1)

mean_temperature_df = pd.DataFrame({'country': temperature_df['country'], 'Mean_temperature': mean_temperature})

# Sort by mean pollution levels in descending order
top_performers = mean_temperature_df.sort_values(by='Mean_temperature', ascending=False).round(2)

# Show top 10
top_performers.head(10)

                  country  Mean_temperature
44                  Haiti             85.25
78                Nigeria             84.15
50              Indonesia             83.45
117  United Arab Emirates             83.07
43                 Guyana             82.80
88                  Qatar             82.74
85            Philippines             82.40
67               Malaysia             82.36
42          Guinea-Bissau             82.35
108              Thailand             82.35

In [67]:
# Sort ascending order 
bottom_performers = mean_temperature_df.sort_values(by='Mean_temperature').round(2)
# Show bottom 10
bottom_performers.head(10)

      country  Mean_temperature
70   Mongolia             30.01
18     Canada             41.30
48    Iceland             41.37
80     Norway             41.62
33    Finland             42.52
90     Russia             44.67
9     Belarus             45.19
62     Latvia             45.22
102    Sweden             45.47
14    Bolivia             45.57

In [68]:
try:
    engine = create_engine('postgresql://dap:dap@192.168.56.30:5432/climate')

    temperature_df.to_sql('global_temperature', engine, index=False, if_exists='replace')

    print("DataFrame uploaded to PostgreSQL successfully.")

except Exception as e:
    print("Error:", e)

DataFrame uploaded to PostgreSQL successfully.